# read design
read_verilog byte_un_striping.v
hierarchy -check -top byte_un_striping

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty cmos_cells.lib

# mapping logic to mycells.lib
abc -liberty cmos_cells.lib

# cleanup
clean

# Create a graphviz DOT file from synsthesized design
show -lib cmos_cell.v

# write synsthesized design
write_verilog byte_unstriping_sintetizado.v
