read_verilog serial_parallel_c.v
hierarchy -check -top serial_parallel_c
proc_arst -global_arst !valid_out_c;
proc_arst -global_arst !Data_out_c;
proc_arst -global_arst !memoria;
proc_arst -global_arst !contador;
proc_arst -global_arst !BC_count;
proc_arst -global_arst !active;
opt; fsm; opt; memory; opt;
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog serial_parallel_e.v