read_verilog word32_8bits_c.v
hierarchy -check -top word32_8bits_c
proc_arst -global_arst !memoria low;
proc_arst -global_arst !contador low;
proc_arst -global_arst !valid low;
opt; fsm; opt; memory; opt;
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog word32_8bits_e.v